In [1]:
import numpy as np
import pandas as pd

#### 1.1numpy中的nan和None值

In [2]:
ar = np.array([1,2,np.nan,3])#创建一个numpy的一维数组，含有NAN值
ar.sum()#处理结果为nan值

nan

In [3]:
ar1 = np.array([1,None,3,4])#创建一个numpy的一维数组，含有None值
ar1.sum()#报错

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [4]:
np.nansum(ar),np.nanmean(ar)#用0来代替nan进行计算

(6.0, 2.0)

#### 1.2pandas中的nan值和none值

In [5]:
df = pd.Series([1,None,4,np.nan])#pandas中将None自动修改为nan值
df

0    1.0
1    NaN
2    4.0
3    NaN
dtype: float64

#### 2.pandas对空值null值的操作

#### 2.1检测是否是null值

In [6]:
se = pd.Series([1,'a',np.nan,None])
se

0       1
1       a
2     NaN
3    None
dtype: object

In [7]:
se.isna()#isnull也可以

0    False
1    False
2     True
3     True
dtype: bool

In [8]:
se.notna()#notnull也可以

0     True
1     True
2    False
3    False
dtype: bool

#### 2.2去除空值

In [9]:
se

0       1
1       a
2     NaN
3    None
dtype: object

In [10]:
se.dropna()#要实际删除需要加inpalce=True参数

0    1
1    a
dtype: object

In [11]:
df = pd.DataFrame([['a',None,3],[np.nan,3,'b'],['c',3,1]])
df

     0    1  2
0    a  NaN  3
1  NaN  3.0  b
2    c  3.0  1

In [12]:
df.dropna(axis=1)

   2
0  3
1  b
2  1

In [13]:
df['C'] = None
df

     0    1  2     C
0    a  NaN  3  None
1  NaN  3.0  b  None
2    c  3.0  1  None

In [14]:
df.dropna(how='all',axis=1)

     0    1  2
0    a  NaN  3
1  NaN  3.0  b
2    c  3.0  1

In [15]:
df.dropna(subset=[0,1,2])#将第0，1，2列有null的行丢掉

   0    1  2     C
2  c  3.0  1  None

In [16]:
df.dropna(subset=[0,1,2],axis=1,inplace=True)#将第0，1，2列有null的列丢掉,并执行这个操作inplace=True

#### 2.3Null值的填充

In [17]:
ser = pd.Series([1,'a',None,np.nan,5])
ser

0       1
1       a
2    None
3     NaN
4       5
dtype: object

In [18]:
ser.fillna(0)#将空值填充为0

0    1
1    a
2    0
3    0
4    5
dtype: object

In [19]:
ser.fillna(0,inplace=True)#将空值填充为0，并应用
ser

0    1
1    a
2    0
3    0
4    5
dtype: object

In [20]:
df

   2
0  3
1  b
2  1

In [21]:
df.fillna(method='ffill')#将空值填充为上一值

   2
0  3
1  b
2  1

In [22]:
df.fillna(method='bfill')#将空值填充为下一值

   2
0  3
1  b
2  1

In [23]:
df.fillna(method='ffill',axis=1,inplace=True)#将空值填充为上一值，并应用